Revit 2024 API
Application.Username Property
 Gets the user name for the current Revit session.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string Username { get; }
Visual Basic
Public ReadOnly Property Username As String
	Get
Visual C++
public:
property String^ Username {
	String^ get ();
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace